{
    "home-button":"홈페이지",
    "bio-button":"약력",
    "works-botton":"포트폴리오",
    
    "my-work":"포트폴리오",
    "my-life":"약력",

    "footer":"여기에 저에게 연락하십시오",
    
    "bio-title":"약력",
    "bio-text1":"안녕하세요, James Glass입니다. 저는 캘리포니아 주 마운틴 뷰에있는 샌프란시스코 베이 지역에서 태어나고 자랐습니다. 매사추세츠 주 애 머스트에있는 햄프셔 칼리지에서 공부 한 예술과 디자인에 항상 관심이있었습니다. 대학을 졸업 한 후 저는 뉴욕 브루클린에서 살았습니다. 2 년 후 나는 모험에 대한 갈증으로 대한민국 서울에 갔고 처음에는 영어 교사와 프리랜서 웹 디자이너로 일했습니다.",
    "bio-text2":"최근 PassByKorea 프런트 엔드 개발자로 일하고 있습니다. 내 직업은 개발자 팀의 일부로 대규모 민첩한 개발 작업 이외에 개별 프로젝트가 포함되어 있습니다. 나는 HTML / CSS, Javascript / Typescript, Dart, Python, PHP, SQL 외에 Flutter, React, Vue, Node.Js, Flask 등의 다양한 프레임 워크에 대해 잘 알고 있습니다. 내 웹 사이트를 확인하여 주셔서 감사합니다!",

    "passby-web-text":"PassBy Web 사이트는 사용자 기반의 프로모션 / 정보 사이트뿐만 아니라 응용 프로그램을 통해 새로운 거래를 촉진하기위한 협력 기업을위한 온라인 포털 역할도합니다. React / Typescript과 Firebase / Firestore를 백엔드로 사용하여 상태 관리의 컨텍스트를 사용하여 사이트를 독립적으로 만들었습니다. 앱이 정식으로 출시되면 비즈니스 포털을 사용할 수 있지만, 프로모션 사이트는 passbykorea.com에 확장됩니다",
    "passby-mobile-text":"PassBy 모바일 응용 프로그램은 MVC 디자인 패턴을 사용하여 프런트 엔드에 Dart / Flutter를 사용하여 백엔드에 Dart / Firebase를 사용하는 데이트 / 소셜 네트워킹 앱입니다. 나의 첫 번째 역할은 프런트 엔드와 백엔드 사이의 연락 원 역할을하는 것이 었습니다. 거기에서는 UI 요소를 컨트롤러 기능에 연결하고 모두를 변경하여보다 효율적으로 작동하도록했습니다. 또한 언어 선택 페이지를 만들거나 응용 프로그램을 처음 사용 여부를 확인하는 등의 백엔드 작업 등 다른 여러 프런트 엔드 작업을 수행했습니다.",
    "petpeeps-text":"PetPeeps은 애완 동물의 주인이 애완 동물을 데려 갈 수있는 술집, 레스토랑, 카페를 찾을 수 있도록 Web 응용 프로그램입니다. 프로젝트의 프론트 엔드는 vuetify 디자인 구성 요소와 vuex 상태 관리를 갖춘 Vue.js을 사용합니다. 프론트 엔드는 axios을 통해 REST-API와 PHP 기반의 백엔드와 MYSQL 데이터베이스와 통신합니다. 또한 Google FirebaseOATH 인증 및 GoogleMaps API를 사용하여 사업을지도에 플롯합니다. 이 프로젝트는 Firebase를 사용하여 사용자 정보를 생성 및 저장하고 사용자의 Google 계정을 사용하여 계정을 만들었습니다. 데이터베이스에 사용자 정보를 저장하는 PHP 백엔드를 만들었습니다. 또한 백엔드와 vuex 저장소 모두를 호출하여 반응이 빠른 표시하는 대화 형 양식을 작성했습니다. 또한 로그인 페이지 또는 가입 페이지 등 많은 디자인 요소에도 노력했습니다.",
    "NoraeCheck-text":"NoraeCheck는 noraebang에서 좋아하는 노래 노래 코드를 검색하거나 사용자 지정 재생 목록을 만들거나 친구와 무작위로 노래 도전을 할 수 있도록 응용 프로그램입니다. 나는이 응용 프로그램에서 다양한 역할을했습니다. HTML / CSS와 Javascript를 조합하여 검색 페이지와 검색 페이지의 레이아웃을 설계했습니다. JavascriptXMLHTTPREQUESTS를 사용하여 API에서 노래를 취득했습니다. 나는 PHP를 사용하여 로그인 및 가입 기능을 만들었습니다. 또한 PHP 기반의 MVC 프레임 워크를 사용하여 사용자를 올바른 페이지와 사용자 정보, 노래, 재생 목록을 저장 한 MYSQL 데이터베이스의 콘텐츠 모두에 연결했습니다. 또한 이러한 데이터베이스에서 정보를 읽고 업데이트하기위한 많은 SQL 쿼리를 작성했습니다.",
    "spps-text":"이것은 내가 세인트 폴 학원 종이 브로셔를 가지고 HTML / CSS만을 사용하여 그 때 wedbsite을 만든 초기 프로젝트입니다."
}